БИТУправление_медицинским_центром_демо/src/InformationRegisters/ОтметкиВыполненияДействий/ОтметкиВыполненияДействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтметкиВыполненияДействий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Выполнено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.Прием</types>
      <types>DocumentRef.ПрохождениеМедосмотра</types>
      <types>DocumentRef.ОтметкаВыполненияМедосмотра</types>
    </type>
  </attributes>
  <dimensions>
    <name>Действие</name>
    <type>
      <types>CatalogRef.ДействияМедосмотра</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеМедОсмотра</name>
    <type>
      <types>DocumentRef.ПрохождениеМедосмотра</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АктивностьЗаписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ОтметкиВыполненияДействий/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура УстановитьАктивностьПоРегистратору.
//
// Параметры:
//  Регистратор	 - ДокументСсылка	 - документ.
//  Значение	 - Булево			 - значение выполнения.
//
Процедура УстановитьАктивностьПоРегистратору(Регистратор, Значение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтметкиВыполненияДействий.Период,
	               |	ОтметкиВыполненияДействий.Действие,
	               |	ОтметкиВыполненияДействий.ПрохождениеМедОсмотра,
	               |	ОтметкиВыполненияДействий.Выполнено,
	               |	ОтметкиВыполненияДействий.ДокументРегистратор
	               |ИЗ
	               |	РегистрСведений.ОтметкиВыполненияДействий КАК ОтметкиВыполненияДействий
	               |ГДЕ
	               |	ОтметкиВыполненияДействий.ДокументРегистратор = &ДокументРегистратор";
	
	Запрос.УстановитьПараметр("ДокументРегистратор", Регистратор);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		МЗ = РегистрыСведений.ОтметкиВыполненияДействий.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ,Выборка);
		МЗ.АктивностьЗаписи = НЕ Значение;
		МЗ.Записать();
	
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти
